In [1]:
import pandas as pd
import numpy as np

In [7]:
from numpy.random import randn

In [16]:
np.random.seed(101)

In [17]:
df = pd.DataFrame(randn(5,4),index='A B C D E'.split(), columns= 'W X Y Z'.split())

In [18]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [19]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [20]:
df[['W','Z']] # pass a list of column names

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [21]:
type(df['W'])

pandas.core.series.Series

### Creating a new column

In [24]:
df['N'] = df['W']+ df['Y']

In [25]:
df

          W         X         Y         Z       new         N
A  2.706850  0.628133  0.907969  0.503826  3.614819  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762  2.796762

In [30]:
del(df['new'])

In [41]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [39]:
df.drop('N',1,inplace=True)

In [40]:
df.loc['A']

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [42]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [43]:
df.drop('E',axis = 0)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [44]:
df.loc['B']

W    0.651118
X   -0.319318
Y   -0.848077
Z    0.605965
Name: B, dtype: float64

In [45]:
df[df > 0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [46]:
df > 0

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [47]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [52]:
df[df['X'] > 0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
C -2.018168  0.740122  0.528813 -0.589001
E  0.190794  1.978757  2.605967  0.683509

In [53]:
df[df['W'] > 0]['Y']

A    0.907969
B   -0.848077
D   -0.933237
E    2.605967
Name: Y, dtype: float64

In [55]:
df[df['W']> 0][['Y','X']]

          Y         X
A  0.907969  0.628133
B -0.848077 -0.319318
D -0.933237 -0.758872
E  2.605967  1.978757

In [64]:
df[(df['W'] > 0) | (df['Y'] > 0)]['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [65]:
newid = 'CA NY WY OR CO'.split()

In [68]:
df['State'] = newid

In [71]:
df.drop('States',axis =1,inplace=True)

In [72]:
df

          W         X         Y         Z State
A  2.706850  0.628133  0.907969  0.503826    CA
B  0.651118 -0.319318 -0.848077  0.605965    NY
C -2.018168  0.740122  0.528813 -0.589001    WY
D  0.188695 -0.758872 -0.933237  0.955057    OR
E  0.190794  1.978757  2.605967  0.683509    CO

In [73]:
df.reset_index()

  index         W         X         Y         Z State
0     A  2.706850  0.628133  0.907969  0.503826    CA
1     B  0.651118 -0.319318 -0.848077  0.605965    NY
2     C -2.018168  0.740122  0.528813 -0.589001    WY
3     D  0.188695 -0.758872 -0.933237  0.955057    OR
4     E  0.190794  1.978757  2.605967  0.683509    CO

In [80]:
df.set_index('State',inplace=True)

In [81]:
df

              W         X         Y         Z
State
CA     2.706850  0.628133  0.907969  0.503826
NY     0.651118 -0.319318 -0.848077  0.605965
WY    -2.018168  0.740122  0.528813 -0.589001
OR     0.188695 -0.758872 -0.933237  0.955057
CO     0.190794  1.978757  2.605967  0.683509

In [82]:
df.reset_index()

  State         W         X         Y         Z
0    CA  2.706850  0.628133  0.907969  0.503826
1    NY  0.651118 -0.319318 -0.848077  0.605965
2    WY -2.018168  0.740122  0.528813 -0.589001
3    OR  0.188695 -0.758872 -0.933237  0.955057
4    CO  0.190794  1.978757  2.605967  0.683509

In [83]:
#index heirarchy

In [96]:
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]

hier_index = list(zip(outside, inside))

In [85]:
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [97]:
hier_index

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [99]:
df = pd.DataFrame(np.random.randn(6,2), index= hier_index, columns = ['A','B'])

In [100]:
df

                A         B
(G1, 1) -0.925874  1.862864
(G1, 2) -1.133817  0.610478
(G1, 3)  0.386030  2.084019
(G2, 1) -0.376519  0.230336
(G2, 2)  0.681209  1.035125
(G2, 3) -0.031160  1.939932

In [91]:
df.loc['G1']

          A         B
1  0.302665  1.693723
2 -1.706086 -1.159119
3 -0.134841  0.390528

In [101]:
pd.__version__

'0.23.0'